AUTO_config_TK_pesok/src/DataProcessors/ОбработкаАссортиментногоКомитета/ОбработкаАссортиментногоКомитета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкаАссортиментногоКомитета</name>
</mdclass:DataProcessor>

AUTO_config_TK_pesok/src/InformationRegisters/ОграничениеАссортимента/ОграничениеАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОграничениеАссортимента</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <comment>0-не введено, 1-введено, 2-РаспродажаСПоследующимВыводом</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БазовыйАссортимент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидАссортимента</name>
    <type>
      <types>CatalogRef.ВидыАссортимента</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/РезультатыВыполненияОбработок/РезультатыВыполненияОбработок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыВыполненияОбработок</name>
  <resources>
    <name>Успешный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СообщенияОбОшибках</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/AccumulationRegisters/ОстаткиТоваровКомпании/ОстаткиТоваровКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваровКомпании</name>
  <comment>Блок учета остатков товаров компании</comment>
  <resources>
    <name>Количество</name>
    <comment>Количественный остаток номенклатуры на складе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозОперация</name>
    <comment>Хозяйственная операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Контрагент или подразделение получатель</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <dimensions>
    <name>СкладКомпании</name>
    <comment>Склад компании</comment>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <comment>Характеристика номенклатуры</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AUTO_config_TK_pesok/src/Enums/СтатусыАссортиментногоКомитета/СтатусыАссортиментногоКомитета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыАссортиментногоКомитета</name>
  <comment>Статус документа АссортиментныйКомитет</comment>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Проверен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Documents/ИзменениеАссортимента/ИзменениеАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеАссортимента</name>
  <registerRecords>InformationRegister.ОграничениеАссортимента</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВАссортимент</name>
    <comment>Дата ввода товар в ассортимент</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ, на основании которого введен данный</comment>
    <type>
      <types>DocumentRef.ИзменениеАссортимента</types>
      <types>DocumentRef.АссортиментныйКомитет</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйАссортимент</name>
      <comment>Товар вводится в базовый ассортимет</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАссортимента</name>
      <type>
        <types>CatalogRef.ВидыАссортимента</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТорговыеПлощадки</name>
    <attributes>
      <name>ТорговаяПлощадка</name>
      <type>
        <types>CatalogRef.ТорговыеПлощадки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Catalogs/ВидыАссортимента/ВидыАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыАссортимента</name>
  <predefined>
    <items>
      <name>ВнутреннийЗаказ</name>
      <description>Внутренний заказ</description>
    </items>
    <items>
      <name>Выводимый</name>
      <description>Выводимый</description>
    </items>
    <items>
      <name>ГруппыАВ_СС1</name>
      <description>Группы А В или  С С1</description>
    </items>
    <items>
      <name>ЗаказПоставщику</name>
      <description>Заказ поставщику</description>
    </items>
    <items>
      <name>Заменный</name>
      <description>Заменный</description>
    </items>
    <items>
      <name>Незаказываемый</name>
      <description>Незаказываемый</description>
    </items>
    <items>
      <name>НовыйТовар</name>
      <description>Новинка</description>
    </items>
    <items>
      <name>ПроизводствоМагазина</name>
      <description>Производство магазина</description>
    </items>
    <items>
      <name>Распродажа</name>
      <description>Распродажа</description>
    </items>
    <items>
      <name>Трансферт</name>
      <description>Трансферт</description>
    </items>
  </predefined>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Catalogs/СкладыКомпании/СкладыКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СкладыКомпании</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение компании, к которому относится склад компании</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенСебестоимости</name>
    <comment>Тип цен из которых считается себестоимость когда не найдены партии при возвратах и прочих оприходованиях</comment>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенРозничнойТорговли</name>
    <comment>Тип цен розничной торговли (для розничного склада)</comment>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Розничный</name>
    <comment>Истина - склад розничный, иначе - оптовый</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСклада</name>
    <type>
      <types>CatalogRef.ВидыСкладов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Районы</name>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВестиУчетПоХарактеристикам</name>
    <comment>Устаревший, использовать вместо регистр &quot;ТК_УчетХарактеристикНаСкладах&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Global_ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаДоставки</name>
    <comment>(АСУ by 4ок)</comment>
    <type>
      <types>CatalogRef.ТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <comment>Номер маршрута доставки (0 если склад не торгует)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АссортиментнаяМатрица</name>
    <type>
      <types>CatalogRef.АссортиментнаяМатрица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриторияПоКОАТУУ</name>
    <comment>Название и код территории по КОАТУУ, на которой расположен склад (торговая точка)</comment>
    <type>
      <types>CatalogRef.КлассификаторКОАТУУ</types>
    </type>
  </attributes>
  <attributes>
    <name>НеАктивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСкладТорговойПлощадки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийСклад</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_Автомата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАвтомата</name>
    <type>
      <types>CatalogRef.ВидыВендингАвтоматов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеЦены</name>
    <attributes>
      <name>ТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦен</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/DataProcessors/ОбработкаАссортиментногоКомитета/ManagerModule.bsl
Функция ПолучитьВидАссортимента(НаДату,Номенклатура,Площадки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОграничениеАссортиментаСрезПоследних.Номенклатура КАК Номенклатура,
	|	ОграничениеАссортиментаСрезПоследних.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ОграничениеАссортиментаСрезПоследних.Состояние КАК Состояние,
	|	ОграничениеАссортиментаСрезПоследних.ВидАссортимента КАК ВидАссортимента,
	|	ВЫБОР
	|		КОГДА ОграничениеАссортиментаСрезПоследних.ВидАссортимента = ЗНАЧЕНИЕ(справочник.ВидыАссортимента.ВнутреннийЗаказ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Распродажа
	|ИЗ
	|	РегистрСведений.ОграничениеАссортимента.СрезПоследних(
	|			&НаДату,
	|			Номенклатура = &Номенклатура
	|				И ТорговаяПлощадка В (&ТорговаяПлощадка)) КАК ОграничениеАссортиментаСрезПоследних
	|ГДЕ
	|	ОграничениеАссортиментаСрезПоследних.Состояние <> 0";
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТорговаяПлощадка", Площадки);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса; 	
	
КонецФункции

Функция УдалимЦепочкуПодчиненных(СсылкаАК,СсылкаИА,РезультатыВыполнения,СтруктураЗаписиЖурнала,ВсЁОк)
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ИзменениеАссортимента1.ДокументОснование КАК ДокументОснование1,
	|	ИзменениеАссортимента1.Ссылка КАК Ссылка1,
	|	ИзменениеАссортимента2.ДокументОснование КАК ДокументОснование2,
	|	ИзменениеАссортимента2.Ссылка КАК Ссылка2,
	|	ИзменениеАссортимента3.ДокументОснование КАК ДокументОснование3,
	|	ИзменениеАссортимента3.Ссылка КАК Ссылка3,
	|	ИзменениеАссортимента4.ДокументОснование КАК ДокументОснование4,
	|	ИзменениеАссортимента4.Ссылка КАК Ссылка4
	|ИЗ
	|	Документ.ИзменениеАссортимента КАК ИзменениеАссортимента1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеАссортимента КАК ИзменениеАссортимента2
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеАссортимента КАК ИзменениеАссортимента3
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеАссортимента КАК ИзменениеАссортимента4
	|				ПО ИзменениеАссортимента3.Ссылка = ИзменениеАссортимента4.ДокументОснование
	|			ПО ИзменениеАссортимента2.Ссылка = ИзменениеАссортимента3.ДокументОснование
	|		ПО ИзменениеАссортимента1.Ссылка = ИзменениеАссортимента2.ДокументОснование
	|ГДЕ
	|	ИзменениеАссортимента1.ДокументОснование = &ДокументОснование
	|	И ИзменениеАссортимента1.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаИА);
	Запрос.УстановитьПараметр("ДокументОснование", СсылкаАК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Попытка
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка1) Тогда
				ВыборкаДетальныеЗаписи.Ссылка1.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка2) Тогда
				ВыборкаДетальныеЗаписи.Ссылка2.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка3) Тогда
				ВыборкаДетальныеЗаписи.Ссылка3.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка4) Тогда
				ВыборкаДетальныеЗаписи.Ссылка4.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
			КонецЕсли;
			Возврат ВсЁОк;
		Исключение
			ВсЁОк = Ложь;
			ОписаниеОшибки = ОписаниеОшибки();
			РезультатыВыполнения.СообщитьОбОшибке("Не удалось УстановитьПометкуУдаления по причине:" + ОписаниеОшибки, СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
			Сообщить("Не удалось УстановитьПометкуУдаления по причине:" + ОписаниеОшибки, СтатусСообщения.Важное);
			Возврат ВсЁОк;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ЗаполнитьДокументАссортимента(СсылкаАК,ХозОперация,Номенклатура,тзПлощадки,СсылкаОснования,РезультатыВыполнения,СтруктураЗаписиЖурнала,ВсЁОк)
	
	ДокАссортимента = Документы.ИзменениеАссортимента.СоздатьДокумент();
	ДокАссортимента.Дата = ТекущаяДата();
	
	ДокАссортимента.ХозОперация = ХозОперация;
	ДокАссортимента.ПодразделениеКомпании = СсылкаАК.ПодразделениеКомпании;
	ДокАссортимента.ДатаВводаВАссортимент = ?(ЗначениеЗаполнено(СсылкаАК.ДатаНачалаДействия),СсылкаАК.ДатаНачалаДействия,СсылкаАК.Дата);
	ДокАссортимента.ДокументОснование = СсылкаОснования;
	
	//ДокАссортимента.Товары.Очистить();
	
	НоваяСтрока = ДокАссортимента.Товары.Добавить();
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.ВидАссортимента = ?(ХозОперация = Справочники.ХозОперации.РаспродажаСПоследующимВыводомИзАссортимента,Справочники.ВидыАссортимента.ВнутреннийЗаказ,Справочники.ВидыАссортимента.Выводимый);
	
	Для Каждого СтрокаПлощадка из тзПлощадки Цикл
		НоваяСтрокаПлощадка = ДокАссортимента.ТорговыеПлощадки.Добавить();
		НоваяСтрокаПлощадка.ТорговаяПлощадка = СтрокаПлощадка.ТорговаяПлощадка;
	КонецЦикла;	
	
	ДокАссортимента.Комментарий = "АК "+СсылкаАК.Контрагент+Символы.ПС+Номенклатура+Символы.ПС+"Создан автоматически из Ассортиментного Комитета";
	ДокАссортимента.ДополнительныеСвойства.Вставить("ОбрабткаЗаданием",Истина);
	
	Попытка
		ДокАссортимента.Записать(РежимЗаписиДокумента.Проведение);	
		Возврат ДокАссортимента.Ссылка;
	Исключение
		ВсЁОк = Ложь;
		ОписаниеОшибки = ОписаниеОшибки();
		РезультатыВыполнения.СообщитьОбОшибке("Не удалось провести документ " + ДокАссортимента + " по причине:" + ОписаниеОшибки, СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
		Сообщить("Не удалось провести документ " + ДокАссортимента + " по причине:" + ОписаниеОшибки, СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Процедура ЗаполнитьПоРаспродаже(ОбъектАК,РезультатыВыполнения,СтруктураЗаписиЖурнала,ВсЁОк)
	
	Для Каждого ТекСтрокаТовары из ОбъектАК.Товары Цикл                  
		Если ЗначениеЗаполнено(ТекСтрокаТовары.Номенклатура) Тогда
			ОтобранныеПлощадки = ОбъектАК.ПлощадкиПоСтроке.Выгрузить(Новый Структура("КлючСтроки", ТекСтрокаТовары.КлючСтроки),"ТорговаяПлощадка");
			
			Если ЗначениеЗаполнено(ТекСтрокаТовары.ДокументАссортимента) Тогда
				Если УдалимЦепочкуПодчиненных(ОбъектАК.Ссылка,ТекСтрокаТовары.ДокументАссортимента,РезультатыВыполнения,СтруктураЗаписиЖурнала,ВсЁОк) Тогда
				Иначе
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
			вт = ПолучитьВидАссортимента(ОбъектАК.ДатаНачалаДействия,ТекСтрокаТовары.Номенклатура,ОтобранныеПлощадки);
			тзРаспродажа = вт.Скопировать(Новый Структура("Распродажа",Истина));
			тзВывод = вт.Скопировать(Новый Структура("Распродажа",Ложь));
			
			ЕстьРаспродажа = ЗначениеЗаполнено(тзРаспродажа);
			ЕстьВывод = ЗначениеЗаполнено(тзВывод);
			
			ДокАссСсылка = Неопределено;
			Если ЕстьВывод Тогда
				ДокАссСсылка = ЗаполнитьДокументАссортимента(ОбъектАК.Ссылка,Справочники.ХозОперации.ВыводТоваровИзАссортимента,ТекСтрокаТовары.Номенклатура,тзВывод,ОбъектАК.Ссылка,РезультатыВыполнения,СтруктураЗаписиЖурнала,ВсЁОк);
				Если ДокАссСсылка = Неопределено Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
			Если ЕстьРаспродажа Тогда
				ДокАссСсылкаР = ЗаполнитьДокументАссортимента(ОбъектАК.Ссылка,Справочники.ХозОперации.РаспродажаСПоследующимВыводомИзАссортимента,ТекСтрокаТовары.Номенклатура,тзРаспродажа,?(ЕстьВывод,ДокАссСсылка,ОбъектАК.Ссылка),РезультатыВыполнения,СтруктураЗаписиЖурнала,ВсЁОк);
				Если ДокАссСсылкаР = Неопределено Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
			Если ДокАссСсылка <> Неопределено Или ДокАссСсылкаР <> Неопределено Тогда
				ТекСтрокаТовары.ДокументАссортимента = ?(ДокАссСсылка = Неопределено,ДокАссСсылкаР,ДокАссСсылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьСтандартно(ОбъектАК,РезультатыВыполнения,СтруктураЗаписиЖурнала,ВсЁОк)
	
	Для Каждого ТекСтрокаТовары из ОбъектАК.Товары Цикл
		Если ЗначениеЗаполнено(ТекСтрокаТовары.Номенклатура) Тогда
			Если ЗначениеЗаполнено(ТекСтрокаТовары.ДокументАссортимента) Тогда
				ДокАссортимента = ТекСтрокаТовары.ДокументАссортимента.ПолучитьОбъект();
				Если ДокАссортимента.ПометкаУдаления Тогда
					ДокАссортимента.УстановитьПометкуУдаления(Ложь);
				КонецЕсли;
			Иначе
				ДокАссортимента = Документы.ИзменениеАссортимента.СоздатьДокумент();
				ДокАссортимента.Дата = ТекущаяДата();
			КонецЕсли;
			
			ДокАссортимента.ХозОперация = ?(ОбъектАК.ХозОперация = Справочники.ХозОперации.ВводНовогоТовараВАссортимент,Справочники.ХозОперации.ВводТоваровВАссортимент,ОбъектАК.ХозОперация);
			ДокАссортимента.ПодразделениеКомпании = ОбъектАК.ПодразделениеКомпании;
			ДокАссортимента.ДатаВводаВАссортимент = ?(ЗначениеЗаполнено(ОбъектАК.ДатаНачалаДействия),ОбъектАК.ДатаНачалаДействия,ОбъектАК.Дата);
			ДокАссортимента.ДокументОснование = ОбъектАК.Ссылка;
			
			ДокАссортимента.Товары.Очистить();
			
			НоваяСтрока = ДокАссортимента.Товары.Добавить();
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Если ОбъектАК.ХозОперация = Справочники.ХозОперации.РаспродажаСПоследующимВыводомИзАссортимента Тогда
				НоваяСтрока.ВидАссортимента = Справочники.ВидыАссортимента.Распродажа;
			ИначеЕсли ОбъектАК.ХозОперация = Справочники.ХозОперации.ВыводТоваровИзАссортимента Тогда
				НоваяСтрока.ВидАссортимента = Справочники.ВидыАссортимента.Выводимый;
			Иначе
				НоваяСтрока.БазовыйАссортимент = ТекСтрокаТовары.БазовыйАссортимент;
				НоваяСтрока.ВидАссортимента = ТекСтрокаТовары.ВидАссортимента;
			КонецЕсли;
			
			ДокАссортимента.ТорговыеПлощадки.Очистить();
			
			ОтобранныеСтрокиПлощадок = ОбъектАК.ПлощадкиПоСтроке.НайтиСтроки(Новый Структура("КлючСтроки", ТекСтрокаТовары.КлючСтроки));
			
			Для Каждого ТекСтрокаПлощадка из ОтобранныеСтрокиПлощадок Цикл
				НоваяСтрокаПлощадка = ДокАссортимента.ТорговыеПлощадки.Добавить();
				НоваяСтрокаПлощадка.ТорговаяПлощадка = ТекСтрокаПлощадка.ТорговаяПлощадка;
			КонецЦикла;	
			
			//ДокАссортимента.УстановитьНовыйНомер();  СообщитьОбОшибке
			ДокАссортимента.Комментарий = "АК "+ОбъектАК.Контрагент+Символы.ПС+ТекСтрокаТовары.Номенклатура+Символы.ПС+"Создан автоматически из Ассортиментного Комитета";
			ДокАссортимента.ДополнительныеСвойства.Вставить("ОбрабткаЗаданием",Истина);
			
			Попытка
				ДокАссортимента.Записать(РежимЗаписиДокумента.Проведение);	
				ТекСтрокаТовары.ДокументАссортимента = ДокАссортимента.Ссылка;
			Исключение
				ВсЁОк = Ложь;
				ОписаниеОшибки = ОписаниеОшибки();
				РезультатыВыполнения.СообщитьОбОшибке("Не удалось провести документ " + ДокАссортимента + " по причине:" + ОписаниеОшибки, СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
				Сообщить("Не удалось провести документ " + ДокАссортимента + " по причине:" + ОписаниеОшибки, СтатусСообщения.Важное);
				Прервать;
			КонецПопытки;
			
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

Функция ОбработатьАссортиментныйКомитет()	Экспорт
	
	ВсЁОк = Истина;
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ОбработатьАссортиментныйКомитет";
	СтруктураЗаписиЖурнала.КлючОбработки = "ОбработкаАссортиментногоКомитета";
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	|	АссортиментныйКомитет.Ссылка КАК Ссылка,
	|	АссортиментныйКомитет.Ссылка.ХозОперация КАК ХозОперация
	|ИЗ
	|	Документ.АссортиментныйКомитет КАК АссортиментныйКомитет
	|ГДЕ
	|	НЕ АссортиментныйКомитет.Ссылка.ПометкаУдаления
	|	И АссортиментныйКомитет.Статус = &Статус
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыАссортиментногоКомитета.Утвержден);
	
	Результат = Запрос.Выполнить();	//	Результат.Выгрузить()
	
	Выборка = Результат.Выбрать();
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки. 	Количество найденных документов		- "+Формат(Выборка.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	ОбработаноДокументов = 0;
	
	Пока Выборка.Следующий() Цикл
		//НачатьТранзакцию();
		ДокОбъектАК = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъектАК.ДополнительныеСвойства.Вставить("ОбрабткаЗаданием",Истина);
		ДокОбъектАК.Статус = Перечисления.СтатусыАссортиментногоКомитета.Обработан;
		
		Если Выборка.ХозОперация = Справочники.ХозОперации.РаспродажаСПоследующимВыводомИзАссортимента Тогда
			ЗаполнитьПоРаспродаже(ДокОбъектАК,РезультатыВыполнения,СтруктураЗаписиЖурнала,ВсЁОк);
		Иначе
			ЗаполнитьСтандартно(ДокОбъектАК,РезультатыВыполнения,СтруктураЗаписиЖурнала,ВсЁОк);
		КонецЕсли;
		
		Если НЕ ВсЁОк Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			ДокОбъектАК.Записать();	
			ОбработаноДокументов = ОбработаноДокументов + 1;
		Исключение
			ВсЁОк = Ложь;
			ОписаниеОшибки = ОписаниеОшибки();
			РезультатыВыполнения.СообщитьОбОшибке("Не удалось провести документ " + ДокОбъектАК + " по причине:" + ОписаниеОшибки, СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
			Сообщить("Не удалось провести документ " + ДокОбъектАК + " по причине:" + ОписаниеОшибки, СтатусСообщения.Важное);
		КонецПопытки;
		
		//Если ВсЁОк Тогда
		//	ЗафиксироватьТранзакцию();
		//КонецЕсли;
		
	КонецЦикла;
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. 	Количество обработанных документов	- "+Формат(ОбработаноДокументов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк);
	Исключение
		//
	КонецПопытки;
	
КонецФункции

Функция ВывестиРаспроданныйТовар(НаДату)	Экспорт
	
	ВсЁОк = Истина;
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ВывестиРаспроданныйТовар";
	СтруктураЗаписиЖурнала.КлючОбработки = "ВыводРаспроданногоТовара";
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	|	ОграничениеАссортиментаСрезПоследних.Регистратор КАК Регистратор,
	|	ОграничениеАссортиментаСрезПоследних.Регистратор.ХозОперация КАК ХозОперация,
	|	ОграничениеАссортиментаСрезПоследних.Номенклатура КАК Номенклатура,
	|	ОграничениеАссортиментаСрезПоследних.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ОграничениеАссортиментаСрезПоследних.Состояние КАК Состояние,
	|	ОграничениеАссортиментаСрезПоследних.ВидАссортимента КАК ВидАссортимента
	|ПОМЕСТИТЬ ТоварРаспродажи
	|ИЗ
	|	РегистрСведений.ОграничениеАссортимента.СрезПоследних(&НаДату, Регистратор ССЫЛКА Документ.ИзменениеАссортимента) КАК ОграничениеАссортиментаСрезПоследних
	|ГДЕ
	|	ОграничениеАссортиментаСрезПоследних.Состояние = 2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СкладыКомпании.Ссылка КАК Ссылка,
	|	СкладыКомпании.АссортиментнаяМатрица КАК АссортиментнаяМатрица
	|ПОМЕСТИТЬ СкладыРЦ
	|ИЗ
	|	Справочник.СкладыКомпании КАК СкладыКомпании
	|ГДЕ
	|	СкладыКомпании.АссортиментнаяМатрица = &АссортиментнаяМатрица
	|	И НЕ СкладыКомпании.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ОстаткиРЦ
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|			&НаДату,
	|			СкладКомпании В
	|					(ВЫБРАТЬ
	|						СкладыРЦ.Ссылка КАК Ссылка
	|					ИЗ
	|						СкладыРЦ КАК СкладыРЦ)
	|				И Номенклатура В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ТоварРаспродажи.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ТоварРаспродажи КАК ТоварРаспродажи)) КАК ОстаткиТоваровКомпанииОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварРаспродажи.Регистратор КАК Регистратор,
	|	ТоварРаспродажи.ХозОперация КАК ХозОперация,
	|	ТоварРаспродажи.Регистратор.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ТоварРаспродажи.Номенклатура КАК Номенклатура,
	|	ТоварРаспродажи.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ТоварРаспродажи.Состояние КАК Состояние,
	|	ТоварРаспродажи.ВидАссортимента КАК ВидАссортимента,
	|	ЕСТЬNULL(ОстаткиРЦ.КоличествоОстаток, 0) КАК Остаток
	|ИЗ
	|	ТоварРаспродажи КАК ТоварРаспродажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиРЦ КАК ОстаткиРЦ
	|		ПО ТоварРаспродажи.Номенклатура = ОстаткиРЦ.Номенклатура
	|ГДЕ
	|	ЕСТЬNULL(ОстаткиРЦ.КоличествоОстаток, 0) <= 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор
	|ИТОГИ
	|	МАКСИМУМ(Номенклатура)
	|ПО
	|	Регистратор
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("АссортиментнаяМатрица", Справочники.АссортиментнаяМатрица.НайтиПоКоду("AT000005"));
	
	Результат = Запрос.Выполнить();	//	Результат.Выгрузить()
	
	ВыборкаРегистратор = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки. 	Количество найденных документов		- "+Формат(ВыборкаРегистратор.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	ОбработаноДокументов = 0;
	
	Пока ВыборкаРегистратор.Следующий() Цикл
		ДокАссортимента = Документы.ИзменениеАссортимента.СоздатьДокумент();
		ДокАссортимента.Дата = ТекущаяДата();
		
		ДокАссортимента.ХозОперация = Справочники.ХозОперации.ВыводТоваровИзАссортимента;
		ДокАссортимента.ПодразделениеКомпании = ВыборкаРегистратор.ПодразделениеКомпании;
		ДокАссортимента.ДатаВводаВАссортимент = НаДату;
		ДокАссортимента.ДокументОснование = ВыборкаРегистратор.Регистратор;
		
		НоваяСтрока = ДокАссортимента.Товары.Добавить();
		НоваяСтрока.Номенклатура = ВыборкаРегистратор.Номенклатура;
		НоваяСтрока.ВидАссортимента = Справочники.ВидыАссортимента.Выводимый;
		
		Выборка = ВыборкаРегистратор.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрокаПлощадка = ДокАссортимента.ТорговыеПлощадки.Добавить();
			НоваяСтрокаПлощадка.ТорговаяПлощадка = Выборка.ТорговаяПлощадка;
		КонецЦикла;	
		
		ДокАссортимента.Комментарий = "Распродано "+ВыборкаРегистратор.Номенклатура+Символы.ПС+"Создан автоматически после распродажи товара";
		ДокАссортимента.ДополнительныеСвойства.Вставить("ОбрабткаЗаданием",Истина);
		
		Попытка
			ДокАссортимента.Записать(РежимЗаписиДокумента.Проведение);	
			ОбработаноДокументов = ОбработаноДокументов + 1;
		Исключение
			ВсЁОк = Ложь;
			ОписаниеОшибки = ОписаниеОшибки();
			РезультатыВыполнения.СообщитьОбОшибке("Не удалось провести документ " + ДокАссортимента + " по причине:" + ОписаниеОшибки, СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
			Сообщить("Не удалось провести документ " + ДокАссортимента + " по причине:" + ОписаниеОшибки, СтатусСообщения.Важное);
		КонецПопытки;
		
	КонецЦикла;
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. 	Количество обработанных документов	- "+Формат(ОбработаноДокументов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк);
	Исключение
		//
	КонецПопытки;
	
КонецФункции
